* sclang kmacro
#+begin_src emacs-lisp
(global-set-key (kbd "<f5>") 'stop-sclang)
#+end_src

#+RESULTS:
: stop-sclang

#+begin_src emacs-lisp
(fset 'stop-sclang
   (lambda (&optional arg) "Keyboard macro." (interactive "p") (kmacro-exec-ring-item (quote ([24 98 87 111 114 107 115 112 97 99 101 return 3 19 24 98 return] 0 "%d")) arg)))


#+end_src

#+RESULTS:
| lambda | (&optional arg) | Keyboard macro. | (interactive p) | (kmacro-exec-ring-item (quote ([24 98 87 111 114 107 115 112 97 99 101 return 3 19 24 98 return] 0 %d)) arg) |


#+begin_src emacs-lisp
;; Keyboard Macro Editor.  Press C-c C-c to finish; press C-x k RET to cancel.
;; Original keys: C-x b W o r k s p a c e RET C-c C-s C-x b RET

Command: last-kbd-macro
Key: none

Macro:

C-x b			;; switch-to-buffer
W			;; self-insert-command
o			;; self-insert-command
r			;; self-insert-command
k			;; self-insert-command
s			;; self-insert-command
p			;; self-insert-command
a			;; self-insert-command
c			;; self-insert-command
e			;; self-insert-command
RET			;; org-return
C-c C-s			;; org-schedule
C-x b			;; switch-to-buffer
RET			;; org-return

#+end_src
